from colorama import Fore,Back,Style
from colorama import init
init(autoreset=True)

print(Fore.BLUE+'Одного літнього дня я вирішив взяти коротку прогулянку в парку поблизу мого будинку. Сонце було яскраве, і повітря наповнювалося спокоєм. Я подавався глибше в лісову частину парку, де було тихо і спокійно.\n\nПід час моєї прогулянки я помітив чоловіка, який сидів на лавці поруч з доріжкою. Його зовнішність вразила мене: він був вельми блідий і видався дуже хворим. Його очі були поглянуті в нікуди,  губи тремтіли. Він майже не міг говорити, і я помітив, що він намагалася щось сказати, але слова виходили дуже важко.\n\nЯ підійшов до нього і запитав, чи все в порядку. Він почав примовляти кілька слів, але було важко розібрати, що він намагався сказати. Видно було, що дуже хвилювався і відчував дискомфорт. Я намагався розуміти, що він говорив, але це було вельми складно.\n\n-Скажи хоч як тебе звати друже\n')

YourName=input()
for c in YourName:
    print("-"+c+"?*%;!")
    break

print(Fore.BLUE+"-Гаразд давай краще відведем тебе до лікаря")
# for i in YourName:
#     if(i!=" "):
#         continue
#     else:
#         i+1
#         print(i)
#         print(i+"^%#@!*")