def Instruction():
    print("\n Гра складається з одного раунду \nза який ви повинні якнайефективніше завдати шкоди свому супернику \nшляхом вибору найефективнішого удару для досягнення цієї задачі \nВсьоого їх існує 3 вида, як і спеціалізацій(про них трохи згодом)\nПри виборі удару ваша базова шкода супернику може зменшитись або збільшитись \n в залежності від того яка у вас спеціалізація \nВмикайте голову!!! ")
    print("Кожного раунду гравцю випадає випадкова спеціалізація ")
    print("Вона існує трьох видів: \n \n1-"+"\033[33m{}\033[0m".format("Мечники")+", ефеетивно наносять - "+"\033[33m{}\033[0m".format("(Ріжучий удар)")+"\n2-"+"\033[34m{}\033[0m".format("Копійники")+", ефективно наносять - "+"\033[34m{}\033[0m".format("(Колючий удар)")+"\n3-"+"\033[31m{}\033[0m".format("Щитоносці")+", ефективно наносять ""\033[31m{}\033[0m".format("(Глухо-роздроблювальний удар) \n"))
    
    print("В кожної їз цих спеціалізацій є свої переваги та недоліки: \n")
    print("\033[33m{}\033[0m".format("Мечники")+" мають перевагу над "+"\033[31m{}\033[0m".format("Щитоносцями")+" але програють "+"\033[34m{}\033[0m".format("Копійникам"))
    print("\033[34m{}\033[0m".format("Копійники")+" мають перевагу над "+"\033[33m{}\033[0m".format("Мечниками")+" але але надзичайно не ефективні проти "+"\033[31m{}\033[0m".format("Щитоносців"))
    print("\033[31m{}\033[0m".format("Щитоносці")+" мають перевагу над "+"\033[34m{}\033[0m".format("Копійниками")+" але програють "+"\033[33m{}\033[0m".format("Мечникам"))

Instructionskip=input("\n                                Вітаємо вас у грі Гладіатори \n       \n                          Бажаєте пропустити інструкцію до гри? y/n \n")
if Instructionskip=="Yes" or Instructionskip=="y" or Instructionskip=="yes" or Instructionskip=="YES":
    print("\n")
elif Instructionskip=="No" or Instructionskip=="n" or Instructionskip=="no" or Instructionskip=="NO":
    Instruction()
else:
    print("Неправильно введені дані. Провсяк випадок ми покажем вам інструкцію")
    Instruction()