# Створення множини з різними кольорами автомобілів
car_colors = {"червоний", "синій", "зелений", "жовтий", "чорний"}

print("Доступні кольори автомобілів:", car_colors)

# Додавання нового кольору до множини
add_color="білий"
print(f"\nДодавання нового кольору до множини: {add_color}")
car_colors.add(add_color)
print("Оновлені доступні кольори автомобілів:", car_colors)

# Видалення кольору з множини
remove_color="чорний"
print(f"\nВидалення кольору з множини: {remove_color}")
car_colors.remove(remove_color)
print("Оновлені доступні кольори автомобілів:", car_colors)

# Перевірка наявності конкретного кольору в множині
if_in_color="червоний"
print(f"\nПеревірка наявності конкретного кольору в множині: {if_in_color}")
if if_in_color in car_colors:
    print(f"{if_in_color} колір доступний.")
else:
    print(f"{if_in_color} колір відсутній.")

# Виведення на екран оновленого списку кольорів автомобілів
print("Оновлені доступні кольори автомобілів:", car_colors)
